matsstaff/stc1000p/src/page0.c
	// This is the thermostat logic
#if defined PB2
	if((LATA4 && (temperature <= setpoint || (probe2 && (temperature2 < (setpoint - hysteresis2))))) || (LATA5 && (temperature >= setpoint || (probe2 && (temperature2 > (setpoint + hysteresis2)))))){
#else
	if((LATA4 && (temperature <= setpoint )) || (LATA5 && (temperature >= setpoint))){
#endif
		cooling_delay = eeprom_read_config(EEADR_MENU_ITEM(cd)) << 6;
		cooling_delay = cooling_delay - (cooling_delay >> 4);
		heating_delay = eeprom_read_config(EEADR_MENU_ITEM(hd)) << 6;
		heating_delay = heating_delay - (heating_delay >> 4);
		LATA4 = 0;
		LATA5 = 0;
	}
	else if(LATA4 == 0 && LATA5 == 0) {
		int hysteresis = eeprom_read_config(EEADR_MENU_ITEM(hy));
#ifdef PB2
		hysteresis2 >>= 2; // Halve hysteresis 2
		if ((temperature > setpoint + hysteresis) && (!probe2 || (temperature2 >= setpoint - hysteresis2))) {
#else
		if (temperature > setpoint + hysteresis) {
#endif
			if (cooling_delay) {
				led_e.e_cool = led_e.e_cool ^ (cooling_delay & 0x1); // Flash to indicate cooling delay
			} else {
				LATA4 = 1;
			}
#if defined PB2
		} else if ((temperature < setpoint - hysteresis) && (!probe2 || (temperature2 <= setpoint + hysteresis2))) {
#else
		} else if (temperature < setpoint - hysteresis) {
#endif
			if (heating_delay) {
				led_e.e_heat = led_e.e_heat ^ (heating_delay & 0x1); // Flash to indicate heating delay
			} else {
				LATA5 = 1;
			}
		}
	}
}

#endif // !OVBSC

/* Initialize hardware etc, on startup.
 * arguments: none
 * returns: nothing
 */
static void init() {

	OSCCON = 0b01101010; // 4MHz

	// Heat, cool as output, Thermistor as input, piezo output
#if defined FO433 || defined OVBSC
	TRISA = 0b00001100;
#else
	TRISA = 0b00001110;
#endif
	LATA = 0; // Drive relays and piezo low

#if defined OVBSC
	// Make sure weak pullup is disabled for RA1
	WPUA1 = 0;
#endif

	// LED Common anodes
	TRISB = 0;
	LATB = 0;

	// LED data (and buttons) output
	TRISC = 0;

	// Analog input on thermistor
#if defined PB2
	ANSELA = _ANSA1 |  _ANSA2 ;
#else
	ANSELA =  _ANSA2;
#endif

	// AD clock FOSC/8 (FOSC = 4MHz)
	ADCS0 = 1;
	// Right justify AD result
	ADFM = 1;

	// IMPORTANT FOR BUTTONS TO WORK!!! Disable analog input -> enables digital input
	ANSELC = 0;

	// Postscaler 1:1, Enable counter, prescaler 1:4
	T2CON = 0b00000101;
	// @4MHz, Timer 2 clock is FOSC/4 -> 1MHz prescale 1:4-> 250kHz, 250 gives interrupt every 1 ms
	PR2 = 250;
	// Enable Timer2 interrupt
	TMR2IE = 1;

	// Postscaler 1:15, - , prescaler 1:16
	T4CON = 0b01110010;
#ifdef OVBSC
	TMR4ON = 1;
#else
	TMR4ON = eeprom_read_config(EEADR_POWER_ON);
#endif
	// @4MHz, Timer 2 clock is FOSC/4 -> 1MHz prescale 1:16-> 62.5kHz, 250 and postscale 1:15 -> 16.66666 Hz or 60ms
	PR4 = 250;

	// Postscaler 1:7, Enable counter, prescaler 1:64
	T6CON = 0b00110111;
	// @4MHz, Timer 2 clock is FOSC/4 -> 1MHz prescale 1:64-> 15.625kHz, 250 and postscale 1:6 -> 8.93Hz or 112ms
	PR6 = 250;

#if defined MINUTE
	// Get initial setpoint
	setpoint = eeprom_read_config(EEADR_MENU_ITEM(SP));
#endif

#if defined COM
	// Set PEIE and GIE (enable global interrupts), IOCIE
	INTCON = 0b11001000;
	IOCAP = 2;	// Rising edge detect
	IOCAN = 0;
#else
	// Set PEIE (enable peripheral interrupts, that is for timer2) and GIE (enable global interrupts)
	INTCON = 0b11000000;
#endif

#if defined FO433
	// Timer 0 prescale 8
	PSA=0;
	PS0=0;
	PS1=1;
	PS2=0;
#endif

}

/* Interrupt service routine.
 * Receives timer2 interrupts every millisecond.
 * Handles multiplexing of the LEDs.
 */
#if defined OVBSC
volatile unsigned char oc = 0;
#endif
static void interrupt_service_routine(void) __interrupt 0 {

#ifdef COM
	if(IOCAF1){

		/* Disable pin change interrupt and edge detection */
		IOCIE = 0;
		IOCAP1 = 0;

		/* If sending a '1' bit */
		if(com_write && (com_data & 0x80)){
			TRISA1 = 0;
			LATA1 = 1;
		}

		/* Init communication reset countdown (10ms) */
		com_tmout = 10;

		/* Enable timer 0 to generate interrupt for reading/writing in 250us */
		TMR0 = 5;
		TMR0CS = 0;
		TMR0IE = 1;

		/* Clear edge detection flag */
		IOCAF = 0;	
	}

	if(TMR0IF){
		/* Disable timer 0 */
		TMR0CS = 1;
		TMR0IE = 0;

		/* Make sure RA1 is input */
		TRISA1 = 1;
		LATA1 = 0;

		/* Shift data */
		com_data <<= 1;
		com_count++;

		/* If receive '1' */
		if(!com_write && RA1){
			com_data |= 1;
		}

		/* Enable edge detection and pin change interrupt */
		IOCAF = 0;
		IOCAP1 = 1;
		IOCIE = 1;

		/* Clear timer 0 interrupt flag */
		TMR0IF = 0;
	}
#elif defined FO433
	if(TMR0IF){
		/* */
		LATA1 = 0;

		if(fo433_send_space){
			fo433_count>>=1;
			TMR0 = 130;
			fo433_send_space = 0;
		} else {
			if(fo433_data & fo433_count){
				TMR0 = 193;
			} else {
				TMR0 = 67;
			}
			LATA1 = 1;
			fo433_send_space = 1;
		}

		if(fo433_count == 0){
			/* Disable timer 0 */
			TMR0CS = 1;
			TMR0IE = 0;
		}

		/* Clear timer 0 interrupt flag */
		TMR0IF = 0;
	}
#endif
	// Check for Timer 2 interrupt
	// Kind of excessive when it's the only enabled interrupt
	// but is nice as reference if more interrupts should be needed
	if (TMR2IF) {
		unsigned char latb = (LATB << 1);

		if(latb == 0){
			latb = 0x10;
		}

		TRISC = 0; // Ensure LED data pins are outputs
		LATB = 0; // Disable LED's while switching

		// Multiplex LED's every millisecond
		switch(latb) {
			case 0x10:
			LATC = led_10.raw;
			break;
			case 0x20:
			LATC = led_1.raw;
			break;
			case 0x40:
			LATC = led_01.raw;
			break;
			case 0x80:
			LATC = led_e.raw;
			break;
		}

		// Enable new LED
		LATB = latb;

#if defined OVBSC
		if(oc){
			oc--;
		}
#endif

#if defined COM
		/* Reset communication state on timeout */
		if(com_tmout){
			com_tmout--;
		} else {
			com_state = 0;
			com_count = 0;
			com_write = 0;
		}
#endif // COM

		// Clear interrupt flag
		TMR2IF = 0;
	}
}

#define START_TCONV_1()		(ADCON0 = _CHS1 | _ADON)
#define START_TCONV_2()		(ADCON0 = _CHS0 | _ADON)

static unsigned int read_ad(unsigned int adfilter){
	ADGO = 1;
	while(ADGO);
	ADON = 0;
	return ((adfilter - (adfilter >> 6)) + ((ADRESH << 8) | ADRESL));
}

